README.md
```mermaid
graph TD;
    A["Android Kotlin"] -->|RPC| B["P2P Daemon Rust"];
    C["iOS Swift"] -->|RPC| B;
    B --> D["Data Repo"];
    D --> E["Personal Data"];
    D --> F["External"];
    G["Sync Admin"] -->|View/Remove<br>Via veilid?| H["Sync Server"];
    B -.->|Code reuse| H;
    I --> H;
    H --> I["P2P Sync Group"];
    I -->|View, Replicate| J["Other peers"];
    J -->|Add archives| I;
```
